lego_man/app/controllers/legos_controller.rb

SELECT "legos".* FROM "legos"
---
  def index
    @legos = Lego.all

SELECT "legos".* FROM "legos" WHERE "legos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @lego = Lego.find(params[:id])

INSERT INTO "legos" ("name", "color", "theme", "gender", "trump", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Kamala"], ["color", "Brown"], ["theme", "politics"], ["gender", "Female"], ["trump", 0], ["created_at", "2020-10-30 19:58:04.160909"], ["updated_at", "2020-10-30 19:58:04.160909"]]
---
  def create

    @lego = Lego.create(params.require(:lego).permit(:name, :color, :theme, :gender, :trump ))

SELECT "legos".* FROM "legos" WHERE "legos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def edit
    @lego = Lego.find(params[:id])

SELECT "legos".* FROM "legos" WHERE "legos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "legos" SET "color" = ?, "updated_at" = ? WHERE "legos"."id" = ?  [["color", "purple"], ["updated_at", "2020-10-30 20:21:24.087229"], ["id", 6]]
---
  def update
    @lego = Lego.find(params[:id])
    @lego.update(params.require(:lego).permit(:name, :color, :theme, :gender, :trump ))